Repository: burakxrd/AuctionSite
Catalog: AuctionSite/Resources/SharedResources.*.resx
Languages: tr

# Welcome
source: Welcome to our Auction Site!
tr: Müzayede Sitemize Hoş Geldiniz!

source: Home
tr: Ana Sayfa

source: Privacy
tr: Gizlilik

source: Error
tr: Hata

# AnErrorOccurred
source: An error occurred while processing your request.
tr: İsteğiniz işlenirken bir hata oluştu.

source: Request ID
tr: İstek Kimliği

source: Development Mode
tr: Geliştirme Modu

# DevelopmentModeExplanation1
source: <strong>Development</strong> environment will display more detailed information about the error that occurred.
tr: <strong>Geliştirme</strong> ortamına geçmek, oluşan hata hakkında daha ayrıntılı bilgi gösterecektir.

# DevelopmentModeWarning1
source: The <strong>Development</strong> environment shouldn't be enabled for deployed applications.
tr: <strong>Geliştirme</strong> ortamı dağıtılan uygulamalar için etkinleştirilmemelidir.

# DevelopmentModeWarning2
source: It can result in displaying sensitive information from exceptions to end users.
tr: Bu, istisnalardan hassas bilgilerin son kullanıcılara gösterilmesine neden olabilir.

# DevelopmentModeExplanation2
source: For local debugging, enable the <strong>Development</strong> environment by setting the <strong>ASPNETCORE_ENVIRONMENT</strong> environment variable to <strong>Development</strong> and restarting the app.
tr: Yerel hata ayıklama için, <strong>ASPNETCORE_ENVIRONMENT</strong> ortam değişkenini <strong>Development</strong> olarak ayarlayarak ve uygulamayı yeniden başlatarak <strong>Geliştirme</strong> ortamını etkinleştirin.

source: Hello
tr: Merhaba

source: Manage Account
tr: Hesabı Yönet

source: Your Bids
tr: Tekliflerim

source: Your Auctions
tr: Açık Artırmalarım

source: Login
tr: Giriş Yap

source: Register
tr: Kaydol

source: Logout
tr: Çıkış Yap

source: Auction Items
tr: Açık Artırma Ürünleri

source: Create New
tr: Yeni Oluştur

source: Details
tr: Detaylar

source: Edit
tr: Düzenle

source: Delete
tr: Sil

source: Back to List
tr: Listeye Geri Dön

source: Place Bid
tr: Teklif Ver

source: Current Bid
tr: Mevcut Teklif

source: Seller
tr: Satıcı

source: Auction Details
tr: Açık Artırma Detayları

source: Your Bid
tr: Teklifiniz

source: Minimum Next Bid
tr: Minimum Sonraki Teklif

source: Auction not found.
tr: Açık artırma bulunamadı.

# AuctionExpired
source: This auction has expired.
tr: Bu açık artırmanın süresi dolmuştur.

# BidAmountTooLow
source: Your bid amount must be at least {0}.
tr: Teklif miktarınız en az {0} olmalıdır.

# BidPlacedSuccessfully
source: Your bid has been placed successfully!
tr: Teklifiniz başarıyla verildi!

source: Latest Bids
tr: Son Teklifler

# NoBidsYet
source: No bids have been placed yet.
tr: Henüz teklif verilmedi.

source: No Image Available
tr: Görsel Yok

# LoginToPlaceBid
source: Please login to place a bid.
tr: Teklif vermek için lütfen giriş yapın.

source: Edit Auction
tr: Açık Artırmayı Düzenle

source: Auction Item
tr: Açık Artırma Öğesi

source: Save
tr: Kaydet

source: Back to Details
tr: Detaylara Geri Dön

# UnauthorizedEdit
source: You are not authorized to edit this auction.
tr: Bu açık artırmayı düzenlemeye yetkiniz yok.

# CannotEditActiveOrBiddedAuction
source: This auction cannot be edited because it is active, expired, or has bids.
tr: Bu açık artırma aktif olduğu, süresi dolduğu veya teklif aldığı için düzenlenemez.

# UploadNewImage
source: Upload New Image (optional)
tr: Yeni Görsel Yükle (isteğe bağlı)

source: Delete Auction
tr: Açık Artırmayı Sil

# AreYouSureToDelete
source: Are you sure you want to delete this?
tr: Bu öğeyi silmek istediğinizden emin misiniz?

# CannotDeleteActiveOrBiddedAuction
source: This auction cannot be deleted because it is active, expired, or has bids.
tr: Bu açık artırma aktif olduğu, süresi dolduğu veya teklif aldığı için silinemez.

source: Auction updated successfully!
tr: Açık artırma başarıyla güncellendi!

source: Auction deleted successfully!
tr: Açık artırma başarıyla silindi!

# LoginRequiredToCreateAuction
source: You must be logged in to create an auction.
tr: Açık artırma oluşturmak için giriş yapmalısınız.

# UnauthorizedEditAttempt
source: You are not authorized to edit this auction.
tr: Bu açık artırmayı düzenlemeye yetkiniz yok.

# CannotEditActiveOrExpiredAuction
source: This auction cannot be edited because it is active or has expired.
tr: Bu açık artırma aktif olduğu, süresi dolduğu veya teklif aldığı için düzenlenemez.

# UnauthorizedDeleteAttempt
source: You are not authorized to delete this auction.
tr: Bu açık artırmayı silmeye yetkiniz yok.

# LoginRequiredToBid
source: You must be logged in to place a bid.
tr: Teklif vermek için giriş yapmalısınız.

# AuctionExpiredCannotBid
source: This auction has expired and cannot receive new bids.
tr: Bu açık artırmanın süresi dolmuştur ve yeni teklif alınamaz.

# AuctionNotStartedYet
source: This auction has not started yet.
tr: Bu açık artırma henüz başlamadı.

# BidMustBeHigherThanCurrentPrice
source: Your bid must be higher than the current price ({0}).
tr: Teklifiniz mevcut fiyattan ({0}) yüksek olmalıdır.

# BidMustMeetMinimumIncrement
source: Your bid must be at least {0} higher than the current price.
tr: Teklifiniz mevcut fiyattan en az {0} kadar yüksek olmalıdır.

# InsufficientBalance
source: You have insufficient virtual balance to place this bid.
tr: Teklif vermek için sanal bakiyeniz yetersiz.

source: Auction Started!
tr: Açık Artırma Başladı!

source: Time until start
tr: Başlamasına Kalan Süre

source: Time remaining
tr: Kalan Süre

source: Active
tr: Aktif

source: Current Bidder
tr: Mevcut Teklif Veren

source: Login to bid
tr: Teklif vermek için giriş yapın

# NoWinner
source: No winner for this auction.
tr: Bu açık artırmanın kazananı yok.

source: Winner
tr: Kazanan

source: Change
tr: Değiştir

source: Change Password
tr: Şifre Değiştir

source: Old Password
tr: Eski Şifre

source: New Password
tr: Yeni Şifre

source: Confirm New Password
tr: Yeni Şifreyi Onayla

source: Change Email
tr: E-posta Değiştir

source: New Email
tr: Yeni E-posta

source: Cancel
tr: İptal

source: Resend Confirmation Email
tr: Onay E-postası Tekrar Gönder

source: Verify Old Email
tr: Eski E-postayı Doğrula

source: Verification Code
tr: Doğrulama Kodu

source: Verify Code
tr: Kodu Doğrula

source: Check New Email
tr: Yeni E-postayı Kontrol Et

source: Back to Manage Account
tr: Hesap Yönetimine Geri Dön

source: Check Current Email
tr: Mevcut E-postayı Kontrol Et

source: Change Username
tr: Kullanıcı Adını Değiştir

source: New Username
tr: Yeni Kullanıcı Adı

source: Username
tr: Kullanıcı Adı

source: Confirm Password
tr: Şifreyi Onayla

# LoginRequired
source: Login is required.
tr: Giriş yapılması gerekiyor.

source: Bid History
tr: Teklif Geçmişi

source: Product Name
tr: Ürün Adı

# ProductNameRequired
source: Product Name is required.
tr: Ürün Adı zorunludur.

# AuctionItem_NameLength
source: The {0} must not exceed {1} characters.
tr: {0} en fazla {1} karakter olabilir.

source: Description
tr: Açıklama

# AuctionItem_DescriptionLength
source: The {0} must not exceed {1} characters.
tr: {0} en fazla {1} karakter olabilir.

source: Starting Price
tr: Başlangıç Fiyatı

# StartingPriceRequired
source: Starting Price is required.
tr: Başlangıç fiyatı zorunludur.

# StartingPriceRange
source: Starting Price must be greater than 0.
tr: Başlangıç fiyatı 0'dan büyük olmalıdır.

source: Minimum Bid Increment
tr: Minimum Teklif

# MinimumBidIncrementRequired
source: Minimum Bid Increment is required.
tr: Minimum teklif artırımı zorunludur.

# MinimumBidIncrementRange
source: Minimum Bid Increment must be greater than 0.
tr: Minimum teklif artırımı 0'dan büyük olmalıdır.

source: Start Time
tr: Başlangıç Zamanı

# StartTimeRequired
source: Start Time is required.
tr: Başlangıç zamanı zorunludur.

source: End Time
tr: Bitiş Zamanı

# EndTimeRequired
source: End Time is required.
tr: Bitiş zamanı zorunludur.

source: Image
tr: Görsel

source: Create New Auction
tr: Yeni Açık Artırma Oluştur

# NoActiveAuctions
source: There are no active auctions at the moment.
tr: Şu anda aktif açık artırma bulunmamaktadır.

source: Time Expired!
tr: Süre Doldu!

# EndTimeText
source: End Time
tr: Bitiş Süresi

# DaysShort
source: d
tr: g

# HoursShort
source: h
tr: s

# MinutesShort
source: m
tr: dk

# SecondsShort
source: s
tr: sn

# AuctionExpiredMessage
source: Auction Ended
tr: Açık Artırma Sona Erdi

# TimeExpiredMessage
source: Time Expired
tr: Süre Doldu

source: Upcoming Auctions
tr: Yaklaşan Açık Artırmalar

# NoUpcomingAuctions
source: There are no upcoming auctions at the moment.
tr: Şu anda yaklaşan açık artırma bulunmamaktadır.

source: View Details
tr: Detayları Görüntüle

source: Active Auctions
tr: Aktif Açık Artırmalar

source: My Auctions
tr: Açık Artırmalarım

# StartTimeCannotBeInPast
source: Start time cannot be in the past.
tr: Başlangıç zamanı geçmiş bir tarih/saat olamaz.

# EndTimeMustBeAfterStartTime
source: End time must be after the start time.
tr: Bitiş zamanı başlangıç zamanından sonra olmalıdır.

# NoExpiredAuctions
source: There are no expired auctions at the moment.
tr: Henüz süresi biten açık artırma bulunmamaktadır.

# CannotBidOnOwnAuction
source: You cannot bid on your own auction.
tr: Kendi açık artırmanıza teklif veremezsiniz.

# Tip_ProductName
source: Choose a short, memorable name that best describes your product. (e.g., 'Antique Silver Pocket Watch', 'Handmade Ceramic Vase')
tr: Ürününüzü en iyi anlatan, kısa ve akılda kalıcı bir isim seçin. (Örn: 'Antika Gümüş Cep Saati', 'El Yapımı Seramik Vazo')

# Tip_Description
source: Describe your product's features (size, material, condition), any flaws, and why it's special. Convince buyers! (Minimum 50 words recommended)
tr: Ürününüzün özelliklerini (boyut, malzeme, durum), varsa kusurlarını ve neden özel olduğunu detaylıca açıklayın. Alıcıları ikna edin! (Minimum 50 kelime önerilir)

# Tip_StartingPrice
source: Set the minimum price your auction will start at. A realistic price can attract more bids. (e.g., $100.00)
tr: Açık artırmanızın başlayacağı minimum fiyatı belirleyin. Gerçekçi bir fiyat, daha fazla teklif çekebilir. (Örn: 100.00 TL)

# Tip_MinimumBidIncrement
source: Determine the minimum amount each new bid must increase the current bid by. Smaller increments can encourage more competition. (e.g., $5.00)
tr: Her yeni teklifin, mevcut teklifin üzerine eklenmesi gereken minimum miktarı belirleyin. Küçük artışlar daha fazla rekabeti teşvik edebilir. (Örn: 5.00 TL)

# Tip_StartTime
source: Select when your auction will begin. It must be a future date and time. (e.g., '07/15/2025 10:00 AM')
tr: Açık artırmanızın ne zaman başlayacağını seçin. Gelecekteki bir tarih ve saat olmalıdır. (Örn: '15.07.2025 10:00')

# Tip_EndTime
source: Choose when your auction will end. It must be after the start time. Allow sufficient time to receive more bids. (e.g., '07/22/2025 10:00 PM')
tr: Açık artırmanızın ne zaman sona ereceğini seçin. Başlangıç zamanından sonra olmalıdır. Yeterli süre tanıyarak daha fazla teklif alabilirsiniz. (Örn: '22.07.2025 22:00')

# Tip_Image
source: Upload high-quality, clear photos of your product from different angles. Good visuals attract buyers and build trust. (Max 5MB, JPG/PNG)
tr: Ürününüzün yüksek kaliteli, net ve farklı açılardan çekilmiş fotoğraflarını yükleyin. İyi görseller, alıcıların ilgisini çeker ve güven verir. (Maksimum 5MB, JPG/PNG)

# PasswordResetConfirmationTitle
source: Password Reset Confirmation
tr: Şifre Sıfırlama Onayı

# PasswordResetConfirmationMessage
source: A link to reset your password has been sent to your email address. Please check your email. If you do not receive the email, please check your spam/junk folder.
tr: Şifrenizi sıfırlamak için e-posta adresinize bir bağlantı gönderilmiştir. Lütfen e-postanızı kontrol edin. Eğer e-posta gelmediyse, spam/gereksiz kutunuzu da kontrol etmeyi unutmayın.

source: Use a local account to log in.
tr: Yerel bir hesap kullanarak giriş yapın.

source: Remember me
tr: Beni Hatırla

# ForgotPasswordLink
source: Forgot your password?
tr: Şifremi unuttum?

# RegisterNewUser
source: Register as a new user
tr: Yeni kullanıcı kaydol

source: Profile Information
tr: Profil Bilgileri

source: Confirmed
tr: Onaylandı

source: Not Confirmed
tr: Onaylanmadı

source: None
tr: Yok

source: Phone Number
tr: Telefon Numarası

source: Virtual Balance
tr: Sanal Bakiye

source: Email
tr: E-posta

source: Password
tr: Şifre

# ResetPasswordTitle
source: Reset Password
tr: Şifreyi Sıfırla

# ResetPasswordInstructions
source: Reset your password.
tr: Şifrenizi sıfırlayın.

# ResetPasswordButton
source: Reset Password
tr: Şifreyi Sıfırla

source: Set Phone Number
tr: Telefon Numarasını Ayarla

source: Current Price
tr: Mevcut Fiyat

source: Status
tr: Durum

# ImageDeletionErrorMessage
source: Error deleting image: {0}
tr: Resim silinirken hata oluştu: {0}

# SmtpSettingsMissing
source: SMTP settings are missing: Host, Username, or Password is empty.
tr: SMTP ayarları eksik: Host, Kullanıcı Adı veya Şifre boş.

source: Auction Site Support
tr: Açık Artırma Sitesi Destek

# EmailSentSuccessfully
source: Email '{0}' successfully sent to '{1}'.
tr: E-posta '{0}' adresine '{1}' başarıyla gönderildi.

# SmtpErrorSendingEmail
source: SMTP error occurred while sending email: {0} - {1}
tr: E-posta gönderilirken SMTP hatası oluştu: {0} - {1}

# UnexpectedErrorSendingEmail
source: An unexpected error occurred while sending email: {0}
tr: E-posta gönderilirken beklenmeyen bir hata oluştu: {0}

# BidAmountRequired
source: The bid amount is required.
tr: Teklif miktarı zorunludur.

# BidAmountRange
source: The bid amount must be greater than 0.
tr: Teklif miktarı 0'dan büyük olmalıdır.

# EmailInvalid
source: Enter a valid email address.
tr: Geçerli bir e-posta adresi girin.

# EmailRequired
source: Email address is required.
tr: E-posta adresi zorunludur.

# NewEmailRequired
source: New email address is required.
tr: Yeni e-posta adresi zorunludur.

# NewPasswordMismatch
source: The new password and confirmation password do not match.
tr: Yeni şifre ve onay şifresi eşleşmiyor.

# NewPasswordRequired
source: New password is required.
tr: Yeni şifre alanı zorunludur.

# OldPasswordRequired
source: Current password is required.
tr: Mevcut şifre alanı zorunludur.

# PasswordMismatch
source: The password and confirmation password do not match.
tr: Şifre ve onay şifresi eşleşmiyor.

# PhoneNumberInvalid
source: Enter a valid phone number.
tr: Geçerli bir telefon numarası girin.

# StringLengthValidation
source: The {0} must be at least {2} and at most {1} characters long.
tr: {0} en az {2} ve en fazla {1} karakter uzunluğunda olmalıdır.

# UsernameRequired
source: Username is required.
tr: Kullanıcı adı zorunludur.

# VerificationCodeRequired
source: Verification code is required.
tr: Doğrulama kodu zorunludur.

# PasswordRequired
source: Password is required.
tr: Şifre zorunludur.

# PhoneNumberUpdateSuccess
source: Your phone number has been updated successfully.
tr: Telefon numaranız başarıyla güncellendi.

source: Auction created successfully!
tr: Açık artırma başarıyla oluşturuldu!

source: Winning Auctions
tr: Kazanılan Açık Artırmalar

# LogoutSuccess
source: Successfully logged out.
tr: Başarıyla çıkış yapıldı.

# LoginSuccess
source: You have successfully logged in.
tr: Başarıyla giriş yaptınız.

# SuccessfullyRegisteredAndLoggedIn
source: You have successfully registered and logged in.
tr: Başarıyla kaydoldunuz ve giriş yaptınız.

# HowItWorksIntro
source: Participating in auctions or selling your own products on our site is very easy! Here is our step-by-step guide:
tr: Sitemizde açık artırmalara katılmak veya kendi ürünlerinizi satmak çok kolay! İşte adım adım rehberimiz:

# RegisterNowButton
source: Register Now
tr: Hemen Kaydol

# BrowseAuctionsButton
source: Explore Auctions
tr: Açık Artırmaları Keşfet
